# Dealing with null values

In [14]:
from numpy import nan
import pandas as pd
import numpy as np

In [15]:
data1={'Name':['person1','person2','person3','person4'],
      'Age':[28,21,nan,38]} #if you use without importing NaN it throws error
data=pd.DataFrame(data1)
data

      Name   Age
0  person1  28.0
1  person2  21.0
2  person3   NaN
3  person4  38.0

In [16]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [17]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

In [18]:
data.dropna()

      Name   Age
0  person1  28.0
1  person2  21.0
3  person4  38.0

# Filling the missing values using mean,median,mode

In [19]:
data['Age'].fillna(data['Age'].mean())  # replcaes null value with mean of table

0    28.0
1    21.0
2    29.0
3    38.0
Name: Age, dtype: float64

In [31]:
data2 = {'Name':['person1','person2','person3','person4','person5'],
     'Age':[23,27,nan,23,27]}

df=pd.DataFrame(data2)
df

      Name   Age
0  person1  23.0
1  person2  27.0
2  person3   NaN
3  person4  23.0
4  person5  27.0

In [32]:
df['Age'].dtype

dtype('float64')

In [33]:
df['Age'].mode()

0    23.0
1    27.0
Name: Age, dtype: float64

In [34]:
df['Age'].mode()[0] #if multiple data have same occurance then it return first occurances

np.float64(23.0)

In [38]:
df['Age'].fillna(data['Age'].mean())

0    23.0
1    27.0
2    29.0
3    23.0
4    27.0
Name: Age, dtype: float64